McGill-Baja-Racing/ESP32DataLogger/Baja_DAQ_3.0/Master_Node/sdkconfig.defaults
# nodes_config.json and log filenames need long filename support.
# Heap-backed LFN avoids adding large filename buffers to task stacks.
# CONFIG_FATFS_LFN_NONE is not set
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=64
CONFIG_FATFS_API_ENCODING_ANSI_OEM=y

# Preserve the supported ESP32-P4 silicon revision and existing runtime settings.
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_1=y
# CONFIG_ESP_SLEEP_GPIO_RESET_WORKAROUND is not set
CONFIG_PM_SLEEP_FUNC_IN_IRAM=y
CONFIG_MBEDTLS_CMAC_C=y
# CONFIG_LIBC_OPTIMIZED_MISALIGNED_ACCESS is not set